bun.org
#+TITLE: Bun Loom: DotCortex
#+DESCRIPTION: Bun global package manifest
#+AUTHOR: Metsatron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Bun manifest
Global Bun packages installed with =bun add -g=.
Columns: PKG VERSION FLAGS REGISTRY EXTRA
Leave VERSION empty to treat the currently installed version as canonical.

#+BEGIN_SRC text :tangle all/.bun/manifest/global.ssv
# ~/DotCortex/all/.bun/manifest/global.ssv
# PKG VERSION FLAGS REGISTRY EXTRA
#+END_SRC

* Isolated Bun env for DotCortex
#+BEGIN_SRC bash :tangle all/.local/bin/dotcortex-bun-env :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/dotcortex-bun-env
set -euo pipefail

export BUN_INSTALL="${BUN_INSTALL:-$HOME/.bun}"
export BUN_GLOBAL_DIR="${BUN_GLOBAL_DIR:-$BUN_INSTALL/install/global}"
export BUN_GLOBAL_BIN_DIR="${BUN_GLOBAL_BIN_DIR:-$BUN_INSTALL/bin}"
export PATH="$BUN_GLOBAL_BIN_DIR:$PATH"

if ! command -v bun >/dev/null 2>&1; then
  if ! command -v curl >/dev/null 2>&1; then
    echo "curl is required to install Bun" >&2
    exit 1
  fi
  curl -fsSL https://bun.com/install | bash
  export PATH="$BUN_GLOBAL_BIN_DIR:$PATH"
fi

exec "$@"
#+END_SRC

* Capture current global Bun -> manifest
#+BEGIN_SRC bash :tangle all/.local/bin/bun-capture :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.bun/manifest/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

"$RUN" python3 - <<'PY' | sort -u >"$tmp_have"
import json
import os
import sys

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    if name:
        print(name)

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY

comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new Bun globals to capture into $MAN"
  exit 0
fi

while read -r pkg; do
  [ -n "$pkg" ] || continue
  printf '%s "" "" "" ""\n' "$pkg" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"
echo "Updated $MAN"
#+END_SRC

* Plan diff
#+BEGIN_SRC bash :tangle all/.local/bin/bun-diff :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.bun/manifest/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

"$RUN" python3 - <<'PY' | sort -u >"$tmp_have"
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    if name:
        print(name)

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY

echo "== bun plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to uninstall]"
comm -13 "$tmp_want" "$tmp_have" | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
#+END_SRC

* Apply manifest inside DotCortex env
#+BEGIN_SRC bash :tangle all/.local/bin/bun-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.bun/manifest/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"
UPDATE="${UPDATE:-0}"

echo "== bun apply =="

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),dequote($5)
    }
  ' "$MAN"
}

declare -A live_ver

while read -r name ver; do
  [ -n "${name:-}" ] || continue
  live_ver["$name"]="$ver"
done < <("$RUN" python3 - <<'PY'
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    version = data.get("version", "")
    if name:
        print(f"{name} {version}")

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY
)

declare -A want_names

while IFS='|' read -r pkg version flags registry extra
do
  [ -n "$pkg" ] || continue
  want_names["$pkg"]=1

  installed_ver="${live_ver[$pkg]:-}"
  if [ -n "$installed_ver" ] && [ "$UPDATE" != "1" ]; then
    continue
  fi

  if [ -n "$installed_ver" ] && [ -n "$version" ] && [ "$version" = "$installed_ver" ]; then
    continue
  fi

  spec="$pkg"
  if [ -n "$version" ]; then
    spec="$pkg@$version"
  fi

  args=(add -g "$spec")

  if [ -n "$flags" ]; then
    IFS=',' read -ra FF <<<"$flags"
    for f in "${FF[@]}"; do
      [ -n "$f" ] && args+=("$f")
    done
  fi

  if [ -n "$registry" ]; then
    args+=(--registry "$registry")
  fi

  "$RUN" bun "${args[@]}"
done < <(_emit_norm)

if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== uninstall extras =="
  for pkg in $(printf '%s\n' "${!live_ver[@]}" | sort); do
    if [ -z "${want_names[$pkg]:-}" ]; then
      "$RUN" bun remove -g "$pkg" || true
    fi
  done
fi

echo "Done."
#+END_SRC

* Health
#+BEGIN_SRC bash :tangle all/.local/bin/bun-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/bun-health
set -euo pipefail

"$HOME/.local/bin/dotcortex-bun-env" bash -c '
echo "BUN       = $(command -v bun || echo missing)"
echo "BUNX      = $(command -v bunx || echo missing)"
echo "bun ver   = $(bun --version 2>/dev/null || echo n/a)"
echo "BUN_INSTALL=${BUN_INSTALL:-}"
echo "BUN_GLOBAL_DIR=${BUN_GLOBAL_DIR:-}"
echo "BUN_GLOBAL_BIN_DIR=${BUN_GLOBAL_BIN_DIR:-}"
echo "Global packages: $(python3 - <<"PY"
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")
count = 0
if os.path.isdir(node_modules):
    for entry in os.listdir(node_modules):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            count += sum(1 for sub in os.listdir(path) if os.path.isdir(os.path.join(path, sub)))
        elif os.path.isdir(path):
            count += 1
print(count)
PY
)"
'
#+END_SRC

* Makefile fragment for Bun
#+BEGIN_SRC makefile :tangle all/.mk/bun.mk :padline no
# ~/DotCortex/all/.mk/bun.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: bun-capture bun-diff bun-sync bun-apply bun-health

bun-capture:
| @chmod +x $(HOME)/.local/bin/bun-capture 2>/dev/null || true
| $(HOME)/.local/bin/bun-capture

bun-diff:
| @chmod +x $(HOME)/.local/bin/bun-diff 2>/dev/null || true
| $(HOME)/.local/bin/bun-diff

bun-sync:
| @chmod +x $(HOME)/.local/bin/bun-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 UPDATE=0 $(HOME)/.local/bin/bun-apply

bun-apply:
| @chmod +x $(HOME)/.local/bin/bun-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=1 UPDATE=0 $(HOME)/.local/bin/bun-apply

bun-health:
| @chmod +x $(HOME)/.local/bin/bun-health 2>/dev/null || true
| $(HOME)/.local/bin/bun-health
#+END_SRC
