all/.local/bin/bun-diff
#!/usr/bin/env bash
# Plan diff

# [[file:../../../bun.org::*Plan diff][Plan diff:1]]
# ~/DotCortex/all/.local/bin/bun-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.bun/manifest/global.ssv"
RUN="$HOME/.local/bin/dotcortex-bun-env"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

"$RUN" python3 - <<'PY' | sort -u >"$tmp_have"
import json
import os

root = os.path.expanduser(os.environ.get("BUN_GLOBAL_DIR", "~/.bun/install/global"))
node_modules = os.path.join(root, "node_modules")

def emit(pkg_dir):
    pkg_json = os.path.join(pkg_dir, "package.json")
    if not os.path.isfile(pkg_json):
        return
    try:
        with open(pkg_json, "r", encoding="utf-8") as fh:
            data = json.load(fh)
    except Exception:
        return
    name = data.get("name")
    if name:
        print(name)

if os.path.isdir(node_modules):
    for entry in sorted(os.listdir(node_modules)):
        path = os.path.join(node_modules, entry)
        if entry.startswith("@") and os.path.isdir(path):
            for sub in sorted(os.listdir(path)):
                emit(os.path.join(path, sub))
        elif os.path.isdir(path):
            emit(path)
PY

echo "== bun plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to uninstall]"
comm -13 "$tmp_want" "$tmp_have" | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
# Plan diff:1 ends here
